pisoFoamPipe/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.1); // initial condition for velocity in all cells, not a boundary condition representation

boundaryField
{
    bottomPatch
    {
        type            fixedValue;
        value           uniform (0 0 0.1);
    }

    wall
    {
        type            noSlip;
    }

    topPatch
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
