pisoFoamPipe/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 3.85e-5;

boundaryField
{
    topPatch
    {
        type            zeroGradient;
    }
    wall
    {
        type            kqRWallFunction; // wall function at high Re
        value           $internalField; // just an initial guess
    }
    bottomPatch
    {
	type		turbulentIntensityKineticEnergyInlet;
	intensity	0.05; // 5% turbulence
	value		$internalField;
    }
}


// ************************************************************************* //
